yi-pian/TI_InvitationTournament/MSPM0_Signal_Contest/10_tests/cmsis_dsp_contest_smoke/cmsis_dsp_contest_smoke.syscfg
/** CMSIS-DSP compile/link smoke test. No board I/O is required. */
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");
const Board = scripting.addModule("/ti/driverlib/Board");
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

ProjectConfig.genLibCMSIS = true;
SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn = true;
